from datetime import datetime  # Импортируем модуль для работы с датой и временем
from math import sqrt  # Импортируем функцию sqrt для вычисления квадратного корня

def main(**kwargs):  # Определяем функцию, которая принимает именованные аргументы
    for key in kwargs.items():  # Проходим по всем переданным парам ключ-значение
        result = sqrt(key[1][0] ** 2 + key[1][1] ** 2)  # Вычисляем длину вектора (по теореме Пифагора)
        print(result)  # Выводим результат

if __name__ == '__main__':  # Проверяем, что код выполняется напрямую
    start_time = datetime.now()  # Сохраняем текущее время (момент начала)
    main(  # Вызываем функцию main с несколькими аргументами
        one=[10, 3],
        two=[5, 4],
        three=[15, 13],
        four=[93, 53],
        five=[133, 15]
    )
    time_costs = datetime.now() - start_time  # Считаем, сколько времени заняло выполнение
    print(f"Время выполнения программы - {time_costs}")  # Выводим время выполнения

